In [52]:
import pandas as pd
from sqlalchemy import create_engine

### Store CSV into DataFrame

In [53]:
athletes_file = "Resources/athlete_events.csv"
athletes_df = pd.read_csv(athletes_file)
athletes_df.head(30)

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN
5,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,"Speed Skating Women's 1,000 metres",NaN
6,5,Christine Jacoba Aaftink,F,25.0,185.0,82.0,Netherlands,NED,1992 Winter,1992,Winter,Albertville,Speed Skating,Speed Skating Women's 500 metres,NaN
7,5,Christine Jacoba Aaftink,F,25.0,185.0,82.0,Netherlands,NED,1992 Winter,1992,Winter,Albertville,Speed Skating,"Speed Skating Women's 1,000 metres",NaN
8,5,Christine Jacoba Aaftink,F,27.0,185.0,82.0,Netherlands,NED,1994 Winter,1994,Winter,Lillehammer,Speed Skating,Speed Skating Women's 500 metres,NaN
9,5,Christine Jacoba Aaftink,F,27.0,185.0,82.0,Netherlands,NED,1994 Winter,1994,Winter,Lillehammer,Speed Skating,"Speed Skating Women's 1,000 metres",NaN
10,6,Per Knut Aaland,M,31.0,188.0,75.0,United States,USA,1992 Winter,1992,Winter,Albertville,Cross Country Skiing,Cross Country Skiing Men's 10 kilometres,NaN
11,6,Per Knut Aaland,M,31.0,188.0,75.0,United States,USA,1992 Winter,1992,Winter,Albertville,Cross Country Skiing,Cross Country Skiing Men's 50 kilometres,NaN
12,6,Per Knut Aaland,M,31.0,188.0,75.0,United States,USA,1992 Winter,1992,Winter,Albertville,Cross Country Skiing,Cross Country Skiing Men's 10/15 kilometres Pu...,NaN
13,6,Per Knut Aaland,M,31.0,188.0,75.0,United States,USA,1992 Winter,1992,Winter,Albertville,Cross Country Skiing,Cross Country Skiing Men's 4 x 10 kilometres R...,NaN
14,6,Per Knut Aaland,M,33.0,188.0,75.0,United States,USA,1994 Winter,1994,Winter,Lillehammer,Cross Country Skiing,Cross Country Skiing Men's 10 kilometres,NaN
15,6,Per Knut Aaland,M,33.0,188.0,75.0,United States,USA,1994 Winter,1994,Winter,Lillehammer,Cross Country Skiing,Cross Country Skiing Men's 30 kilometres,NaN
16,6,Per Knut Aaland,M,33.0,188.0,75.0,United States,USA,1994 Winter,1994,Winter,Lillehammer,Cross Country Skiing,Cross Country Skiing Men's 10/15 kilometres Pu...,NaN
17,6,Per Knut Aaland,M,33.0,188.0,75.0,United States,USA,1994 Winter,1994,Winter,Lillehammer,Cross Country Skiing,Cross Country Skiing Men's 4 x 10 kilometres R...,NaN
18,7,John Aalberg,M,31.0,183.0,72.0,United States,USA,1992 Winter,1992,Winter,Albertville,Cross Country Skiing,Cross Country Skiing Men's 10 kilometres,NaN
19,7,John Aalberg,M,31.0,183.0,72.0,United States,USA,1992 Winter,1992,Winter,Albertville,Cross Country Skiing,Cross Country Skiing Men's 50 kilometres,NaN
20,7,John Aalberg,M,31.0,183.0,72.0,United States,USA,1992 Winter,1992,Winter,Albertville,Cross Country Skiing,Cross Country Skiing Men's 10/15 kilometres Pu...,NaN
21,7,John Aalberg,M,31.0,183.0,72.0,United States,USA,1992 Winter,1992,Winter,Albertville,Cross Country Skiing,Cross Country Skiing Men's 4 x 10 kilometres R...,NaN
22,7,John Aalberg,M,33.0,183.0,72.0,United States,USA,1994 Winter,1994,Winter,Lillehammer,Cross Country Skiing,Cross Country Skiing Men's 10 kilometres,NaN
23,7,John Aalberg,M,33.0,183.0,72.0,United States,USA,1994 Winter,1994,Winter,Lillehammer,Cross Country Skiing,Cross Country Skiing Men's 30 kilometres,NaN
24,7,John Aalberg,M,33.0,183.0,72.0,United States,USA,1994 Winter,1994,Winter,Lillehammer,Cross Country Skiing,Cross Country Skiing Men's 10/15 kilometres Pu...,NaN
25,7,John Aalberg,M,33.0,183.0,72.0,United States,USA,1994 Winter,1994,Winter,Lillehammer,Cross Country Skiing,Cross Country Skiing Men's 4 x 10 kilometres R...,NaN
26,8,"Cornelia ""Cor"" Aalten (-Strannood)",F,18.0,168.0,NaN,Netherlands,NED,1932 Summer,1932,Summer,Los Angeles,Athletics,Athletics Women's 100 metres,NaN
27,8,"Cornelia ""Cor"" Aalten (-Strannood)",F,18.0,168.0,NaN,Netherlands,NED,1932 Summer,1932,Summer,Los Angeles,Athletics,Athletics Women's 4 x 100 metres Relay,NaN
28,9,Antti Sami Aalto,M,26.0,186.0,96.0,Finland,FIN,2002 Winter,2002,Winter,Salt Lake City,Ice Hockey,Ice Hockey Men's Ice Hockey,NaN
29,10,"Einar Ferdinand ""Einari"" Aalto",M,26.0,NaN,NaN,Finland,FIN,1952 Summer,1952,Summer,Helsinki,Swimming,Swimming Men's 400 metres Freestyle,NaN

### Create new data with select columns

In [54]:
transformed_athletes = athletes_df[['ID','Name','Sex','NOC','Sport','Medal']].copy()
transformed_athletes.head()

   ID                      Name Sex  NOC          Sport Medal
0   1                 A Dijiang   M  CHN     Basketball   NaN
1   2                  A Lamusi   M  CHN           Judo   NaN
2   3       Gunnar Nielsen Aaby   M  DEN       Football   NaN
3   4      Edgar Lindenau Aabye   M  DEN     Tug-Of-War  Gold
4   5  Christine Jacoba Aaftink   F  NED  Speed Skating   NaN

In [55]:
transformed_athletes = transformed_athletes.rename(columns={'ID':'id',
                                                            'Name':'athlete_name',
                                                            'Sex':'gender',
                                                            'NOC':'noc',
                                                            'Sport':'event_name',
                                                            'Medal':'medal'})
transformed_athletes.medal.fillna('NONE', inplace=True)
transformed_athletes.drop_duplicates('id', inplace=True)
transformed_athletes.set_index('id', inplace=True)

transformed_athletes.head()

                athlete_name gender  noc     event_name medal
id
1                  A Dijiang      M  CHN     Basketball  NONE
2                   A Lamusi      M  CHN           Judo  NONE
3        Gunnar Nielsen Aaby      M  DEN       Football  NONE
4       Edgar Lindenau Aabye      M  DEN     Tug-Of-War  Gold
5   Christine Jacoba Aaftink      F  NED  Speed Skating  NONE

In [56]:
athletes_df.head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN

In [58]:
olympicGames_df = athletes_df[['ID','NOC','Games','City']].copy()
olympicGames_df = olympicGames_df.rename(columns={'ID':'id',
                                                    'NOC':'noc',
                                                    'Games':'olympic_games',
                                                    'City':'host_city'})
olympicGames_df.drop_duplicates('id', inplace=True)
olympicGames_df.set_index('id', inplace=True)

olympicGames_df.head(30)

    noc olympic_games       host_city
id
1   CHN   1992 Summer       Barcelona
2   CHN   2012 Summer          London
3   DEN   1920 Summer       Antwerpen
4   DEN   1900 Summer           Paris
5   NED   1988 Winter         Calgary
6   USA   1992 Winter     Albertville
7   USA   1992 Winter     Albertville
8   NED   1932 Summer     Los Angeles
9   FIN   2002 Winter  Salt Lake City
10  FIN   1952 Summer        Helsinki
11  FIN   1980 Winter     Lake Placid
12  FIN   2000 Summer          Sydney
13  FIN   1996 Summer         Atlanta
14  FIN   1994 Winter     Lillehammer
15  FIN   1912 Summer       Stockholm
16  FIN   2014 Winter           Sochi
17  FIN   1948 Summer          London
18  FIN   2000 Summer          Sydney
19  FIN   1948 Summer          London
20  NOR   1992 Winter     Albertville
21  NOR   2008 Summer         Beijing
22  ROU   2016 Summer  Rio de Janeiro
23  NOR   2000 Summer          Sydney
24  NOR   1960 Winter    Squaw Valley
25  NOR   1920 Summer       Antwerpen
26  NOR   1984 Winter        Sarajevo
27  NED   1984 Summer     Los Angeles
28  NOR   1968 Summer     Mexico City
29  NED   1988 Summer           Seoul
30  NED   1996 Summer         Atlanta

In [59]:
region_file = "Resources/noc_regions.csv"
regions_df = pd.read_csv(region_file)
regions_df.head()

   NOC       region                 notes
0  AFG  Afghanistan                   NaN
1  AHO      Curacao  Netherlands Antilles
2  ALB      Albania                   NaN
3  ALG      Algeria                   NaN
4  AND      Andorra                   NaN

In [60]:
regions_df.notes.fillna(regions_df.region, inplace=True)
transformed_regions = regions_df.rename(columns={'NOC':'noc',
                                                'region':'country',
                                                'notes':'region'})
transformed_regions.set_index('noc', inplace=True)
transformed_regions.head()

         country                region
noc
AFG  Afghanistan           Afghanistan
AHO      Curacao  Netherlands Antilles
ALB      Albania               Albania
ALG      Algeria               Algeria
AND      Andorra               Andorra

### Connect to local database

In [61]:
rds_connection_string = "postgres:postgres@localhost:5432/olympics_db"
engine = create_engine(f'postgresql://{rds_connection_string}')

### Check for tables

In [62]:
engine.table_names()

['regions', 'athletes', 'olympic_games']

In [63]:
transformed_regions.to_sql(name='regions', con=engine, if_exists='append', index=True)

In [64]:
olympicGames_df.to_sql(name='olympic_games', con=engine, if_exists='append', index=True)

### Use pandas to load json converted DataFrame into database

In [65]:
transformed_athletes.to_sql(name='athletes', con=engine, if_exists='append', index=True)

IntegrityError: (psycopg2.errors.UniqueViolation) duplicate key value violates unique constraint "athletes_pkey"
DETAIL:  Key (id)=(1) already exists.

[SQL: INSERT INTO athletes (id, athlete_name, gender, noc, event_name, medal) VALUES (%(id)s, %(athlete_name)s, %(gender)s, %(noc)s, %(event_name)s, %(medal)s)]
[parameters: ({'id': 1, 'athlete_name': 'A Dijiang', 'gender': 'M', 'noc': 'CHN', 'event_name': 'Basketball', 'medal': 'NONE'}, {'id': 2, 'athlete_name': 'A Lamusi', 'gender': 'M', 'noc': 'CHN', 'event_name': 'Judo', 'medal': 'NONE'}, {'id': 3, 'athlete_name': 'Gunnar Nielsen Aaby', 'gender': 'M', 'noc': 'DEN', 'event_name': 'Football', 'medal': 'NONE'}, {'id': 4, 'athlete_name': 'Edgar Lindenau Aabye', 'gender': 'M', 'noc': 'DEN', 'event_name': 'Tug-Of-War', 'medal': 'Gold'}, {'id': 5, 'athlete_name': 'Christine Jacoba Aaftink', 'gender': 'F', 'noc': 'NED', 'event_name': 'Speed Skating', 'medal': 'NONE'}, {'id': 6, 'athlete_name': 'Per Knut Aaland', 'gender': 'M', 'noc': 'USA', 'event_name': 'Cross Country Skiing', 'medal': 'NONE'}, {'id': 7, 'athlete_name': 'John Aalberg', 'gender': 'M', 'noc': 'USA', 'event_name': 'Cross Country Skiing', 'medal': 'NONE'}, {'id': 8, 'athlete_name': 'Cornelia "Cor" Aalten (-Strannood)', 'gender': 'F', 'noc': 'NED', 'event_name': 'Athletics', 'medal': 'NONE'}  ... displaying 10 of 135571 total bound parameter sets ...  {'id': 135570, 'athlete_name': 'Piotr ya', 'gender': 'M', 'noc': 'POL', 'event_name': 'Ski Jumping', 'medal': 'NONE'}, {'id': 135571, 'athlete_name': 'Tomasz Ireneusz ya', 'gender': 'M', 'noc': 'POL', 'event_name': 'Bobsleigh', 'medal': 'NONE'})]
(Background on this error at: http://sqlalche.me/e/13/gkpj)

### Confirm data has been added by querying the customer_name table
* NOTE: can also check using pgAdmin

In [66]:
pd.read_sql_query('select * from athletes', con=engine).head()

   id              athlete_name gender  noc     event_name medal
0   1                 A Dijiang      M  CHN     Basketball  NONE
1   2                  A Lamusi      M  CHN           Judo  NONE
2   3       Gunnar Nielsen Aaby      M  DEN       Football  NONE
3   4      Edgar Lindenau Aabye      M  DEN     Tug-Of-War  Gold
4   5  Christine Jacoba Aaftink      F  NED  Speed Skating  NONE

### Confirm data has been added by querying the customer_location table

In [67]:
pd.read_sql_query('select * from olympic_games', con=engine).head()

   id  noc olympic_games  host_city
0   1  CHN   1992 Summer  Barcelona
1   2  CHN   2012 Summer     London
2   3  DEN   1920 Summer  Antwerpen
3   4  DEN   1900 Summer      Paris
4   5  NED   1988 Winter    Calgary

In [68]:
pd.read_sql_query('select * from regions', con=engine).head()

   noc      country                region
0  AFG  Afghanistan           Afghanistan
1  AHO      Curacao  Netherlands Antilles
2  ALB      Albania               Albania
3  ALG      Algeria               Algeria
4  AND      Andorra               Andorra